nxp-mcuxpresso/mcux-mcmgr/src/mcmgr_internal_core_api_kw47b42_ext.c
/*
 * Copyright 2022-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "mcmgr.h"
#include "mcmgr_internal_core_api.h"
#include "fsl_device_registers.h"

#if defined(SDK_OS_FREE_RTOS)
#include "FreeRTOS.h"
#endif

mcmgr_status_t mcmgr_platform_init_internal_early(mcmgr_core_t coreNum);

#ifndef IMU_ISR_PRIORITY
#define IMU_ISR_PRIORITY (4U)
#endif

/* The highest interrupt priority that can be used by any interrupt service
 * routine that makes calls to interrupt safe FreeRTOS API functions
 * (higher priorities are lower numeric values) */
#if defined(configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY)
#if IMU_ISR_PRIORITY < configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY
#error "IMU_ISR_PRIORITY value must be greater than or equal to configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY"
#endif
#endif

mcmgr_status_t mcmgr_platform_init_internal(mcmgr_core_t coreNum)
{
    mcmgr_status_t status = mcmgr_platform_init_internal_early(coreNum);
    if (status != kStatus_MCMGR_Success)
    {
        return status;
    }

#if defined(IMU_CPU_INDEX) && (IMU_CPU_INDEX == 1U)
    NVIC_SetPriority((IRQn_Type)RF_IMU0_IRQn, IMU_ISR_PRIORITY);
    NVIC_EnableIRQ((IRQn_Type)RF_IMU0_IRQn);
#elif defined(IMU_CPU_INDEX) && (IMU_CPU_INDEX == 2U)
    NVIC_SetPriority((IRQn_Type)CPU2_MSG_RDY_INT_IRQn, IMU_ISR_PRIORITY);
    NVIC_EnableIRQ((IRQn_Type)CPU2_MSG_RDY_INT_IRQn);
#endif

    return kStatus_MCMGR_Success;
}

mcmgr_core_t mcmgr_get_current_core_internal(void)
{
#if defined(IMU_CPU_INDEX) && (IMU_CPU_INDEX == 1U)
    return kMCMGR_Core0;
#elif defined(IMU_CPU_INDEX) && (IMU_CPU_INDEX == 2U)
    return kMCMGR_Core1;
#endif
}
